/**************************************************************************
* Copyright    : Copyright(C), 2019, pxf, person.
* File name    : Func.c
* Author       : pxf
* Version      : v1.0
* Created on   : 2020/07/07 11:40:58
* Description  : 
* Others       : 
* History      : 200707 pxf 初次建立
***************************************************************************/

/*头文件包含*/
#include "./Func.h"

/*名称 : Func()
* 输入 : 无
* 输出 : 无
* 其他 : 无
***********************************************/
void Func(void){
}

/**************************** Copyright(C) pxf ****************************/
