/**************************************************************************
* Copyright    : Copyright(C), 2019, pxf, person.
* File name    : CpnMemTest.h
* Author       : pxf
* Version      : v1.0
* Created on   : 2020/12/09 11:41:03
* Description  : CpnMemTest类及接口声明头文件
* Others       : 
* History      : 201209 pxf 初次建立
***************************************************************************/

#ifndef CPNMEMTEST_H_
#define CPNMEMTEST_H_

/*头文件包含*/
#include "../../cpnBasics/standType/standType.h"
#include "../../cpnBasics/oopc/oopc.h"

/***********************************************************
* 版本定义
***********************************************************/
#define CPNMEMTEST_MACRO_VERSION        0xC01D00    /* C代表V，D代表.，当前版本V1.00 */

/***********************************************************
* 数据类型定义
***********************************************************/
/*数据声明
***********************************************/
//typedef struct{
//    uint16 id;
//    uint16 code;
//} tErrCode;
//TODO
/*数据引用
***********************************************/
//TODO

/***********************************************************
* 接口定义
***********************************************************/
/*接口声明
***********************************************/
//INF(get){
//  uint16(*get)(void);
//};
//TODO

/***********************************************************
* CpnMemTest类定义
***********************************************************/
/*CpnMemTest类声明
***********************************************/
CL(CpnMemTest){
    hCpnMemTest self;
    hCpnMemTest (*init)(hCpnMemTest cthis);

    // CpnMemTest类参数
    //TODO

    // CpnMemTest类功能函数
    void (*run)(hCpnMemTest cthis);
    //TODO
};

#endif /*CPNMEMTEST_H_*/

/**************************** Copyright(C) pxf ****************************/
