/**************************************************************************
* Copyright    : Copyright(C), 2019, pxf, person.
* File name    : CpnTest.h
* Author       : pxf
* Version      : v1.0
* Created on   : 2020/07/23 17:26:23
* Description  : CpnTest类及接口声明头文件
* Others       :
* History      : 200723 pxf 初次建立
***************************************************************************/

#ifndef CPNTEST_H_
#define CPNTEST_H_

/*头文件包含*/
#include "../../CpnBasics/standType/standType.h"
#include "../../CpnBasics/oopc/oopc.h"

/***********************************************************
* 数据类型定义
***********************************************************/
/*数据声明
***********************************************/
//typedef struct{
//    uint16 id;
//    uint16 code;
//} tErrCode;
//TODO
/*数据引用
***********************************************/
//TODO

/***********************************************************
* 接口定义
***********************************************************/
/*接口声明
***********************************************/
//INF(get){
//  uint16(*get)(void);
//};
//TODO

/***********************************************************
* CpnTest类定义
***********************************************************/
/*CpnTest类声明
***********************************************/
CL(CpnTest){
    hCpnTest self;
    hCpnTest (*init)(hCpnTest cthis);

    // CpnTest类参数
    //TODO

    // CpnTest类功能函数
    void (*run)(hCpnTest cthis);
    //TODO
};

#endif /*CPNTEST_H_*/

/**************************** Copyright(C) pxf ****************************/
