/**************************************************************************
* Copyright    : Copyright(C), 2019, pxf, person.
* File name    : CpnCanCfg.h
* Author       : pxf
* Version      : v1.0
* Created on   : 2020/07/07 16:09:24
* Description  : 
* Others       : 
* History      : 200707 pxf 初次建立
***************************************************************************/

#ifndef CPNCANCFG_H_
#define CPNCANCFG_H_

/*头文件包含*/

/***********************************************************
* 配置参数
***********************************************************/
#define CPNCAN_FIFO_BUFF_LENGTH            16U   /* 队列存储故障个数 */

#endif /*CPNCANCFG_H_*/

/**************************** Copyright(C) pxf ****************************/
